{
  "title": "UW Guide",
  "content": "Comprehensive step-by-step guide for upgrading your first 5 Ultimate Weapons optimally. TARGET AUDIENCE: Players who haven't reached Legend League or have under-leveled Econ UWs. GUIDE GOALS: UW unlock order, upgrade timing, efficient sync strategies, avoiding common pitfalls. UNLOCK ORDER: 1) Golden Tower (GT) 2) Black Hole (BH) 3) Death Wave (DW) 4) Spotlight (SL) 5) Chain Lightning (CL). THE SYNC CONCEPT: GT/BH/DW can sync 1:1:1 for multiplicative bonuses (max x2041 coins). GT x24.75, BH x11, DW x2.5, SL x3. CRITICAL: Don't upgrade cooldowns until understanding sync. LAB PRIORITY: BH Coin Bonus > GT Bonus > DW Coin Bonus >= SL Coin Bonus. GT duration should be 12s+ longer than BH (BH has +12s perk in farming). STEP 1 - UNLOCK 3-5 UWs: Get The Big 3 (GT/BH/DW). First 3 cost 5/50/150 stones. Priority labs: GT Duration, BH Coin Bonus, Extra BH, DW Coin Bonus, DW Health. STEP 2 - PREP 1ST SYNC: Before syncing GT to BH (910 stones), upgrade UWs. GT: 5x→9x bonus (115 stones), 15s→27s duration (74 stones). BH: 30m→40m size (62 stones). Keep cooldowns at GT/DW 5m, BH 3m20s. STEP 3 - 1ST GREAT SAVE: Save 910 stones to sync GT to 3m20s. While saving, max BH Coin Bonus lab, GT Duration lab (12s+ longer than BH), GT Bonus lab, DW Coin Bonus lab. STEP 4 - PREP 2ND SYNC: Capitalize on GT/BH sync before DW sync (800 stones). Upgrade GT: 9x→13.8x bonus (557 stones), 27s→37s duration (285 stones). BH: 40m→50m size (325 stones), 15s→25s duration (455 stones). DW: 1x→2x quantity (200 stones). Sync all to 3m then 2m50s (788 stones total). STEP 5 - 2ND GREAT SAVE: Save 800 stones to sync DW to 3m20s. Focus on coin bonus labs: GT Bonus 1-2 below BH, DW 1-2 below GT, BH 1-2 levels, repeat to lvl 20. MULTIVERSE NEXUS (MVN): Syncs GT/BH/DW automatically with average cooldown. Can upgrade cooldowns gradually. Still aim for 1:1:1 sync. Don't upgrade BH cooldown. STEP 6 - SPOTLIGHT: Catch SL up to DW (1770 stones). SL Angle 30°→31° (5), Quantity 1→2 (375), Angle 31°→35° (130), SPOTLIGHT BREAK to upgrade GT/BH/DW (2155 stones), Quantity 2→3 (850), Angle 35°→40° (410). STEP 7 - CHAIN LIGHTNING: REQUIRES Dimension Core (DC) module. DC provides: 60% initial target hit, 2x shock chance, 2x shock multiplier, shock stacks 5x-20x. Upgrade path: Damage 2x→9x→32x→309x+, Quantity 1→3→4, Chance 5%→12.5%→20%. IMPORTANT: Don't farm with CL (kills enemies before BH scoops). STEP 8 - FINISHING TOUCHES: Max UW labs (GT Duration, BH Coin Bonus, GT Bonus to 20, SL/DW Coin Bonus). Lower cooldowns to 2m30s (150s syncs with Golden Bot 100s 3:2). GT Bonus to 20x+, BH/GT Duration 33s+/45s+, 100% BH coverage (60-64m size), SL Angle to 45° (prep for 4th spotlight). STEP 9 - END-GAME: Sync to 1m40s. PERMANENT BH (perma-BH): 100% uptime, only bosses/elites damage. WARNING: Too early decreases coins/hour (turning point ~2m30s GT/DW cooldowns). 3 methods: Max BH 50s/38s duration (expensive), Galaxy Compressor module (BEST), or max cooldown + legendary mod sub-effects. CARD MASTERIES (T16 W100): Super Tower 1000 stones, Damage 750, Wave Accelerator 1000, Enemy Balance 1000, Intro Sprint 1250. Worth before 4th spotlight and PS/ILM. 4TH SPOTLIGHT: 2500 stones, 45° = 50% coverage. Faster growth than GT+ if GT not developed. GOLDEN TOWER PLUS: After all UWs unlocked. Wait for developed GT. Bonus based on GT+ level and enemies killed during GT. Want high GT duration. PERMANENT GT: Requires maxed GT cooldown, Ancestral MVN with DW/GT sub-effects, Ancestral GComp high package chance, long GT duration. KEY ADVICE: Do NOT upgrade cooldowns 1 at a time (ruins sync). Save full stone amounts (910 GT, 800 DW). UW Labs > Stone upgrades early. Balance tower labs with UW labs. Econ UW upgrades > unlocking all UWs. GT/BH sync most important. Medals: Themes/Relics/Songs before stones. Golden Bot not priority until 44m+ range, 4x+ bonus, 25s+ duration. Restart tower if 1st UW not GT/BH/DW/SL/CL.",
  "author": "Kairos",
  "source_url": "https://www.reddit.com/r/TheTowerGame/",
  "tags": ["ultimate weapons", "strategy", "guide", "progression", "economy", "sync", "GT", "BH", "DW", "SL", "CL", "tower game", "econ build", "lab priority"]
}